---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateElementInView
source: html/b1c0680e-2f86-038c-6d5a-04f6a3698009.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateElementInView Property

Can't create this kind of element in this view in the current mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateElementInView { get; }
```